spoemb/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
#include <map>
#include "nrf_delay.h"


#include "bma400.h"
#include "bma400.hpp"
#include "bma400_defs.h"

#include "debug.hpp"
#include "nrf_delay.h"
#include "nrf_i2c.hpp"
#include "bsp.hpp"

#include "gpio.hpp"
#include "nrf_gpio.h"
#include "pmu.hpp"
#include "error.hpp"
#include "nrf_irq.hpp"

#include <variant>

#define SENSOR_TICK_TO_S  (0.0000390625f)
//TODO:
// Fix all low power/wakeup configuration and mode
// Fix calibration mix with data.


// -- Helper function to convert between enum and string --

namespace BMA_ACC
{
    enum class AccelerometerRange : int
    {
        RANGE_2G    = 2,
        RANGE_4G    = 4,
        RANGE_8G    = 8,
        RANGE_16G   = 16
    };

    uint8_t toUInt(AccelerometerRange range)
    {
        switch (range)
        {
            case AccelerometerRange::RANGE_2G: return BMA400_RANGE_2G;
            case AccelerometerRange::RANGE_4G: return BMA400_RANGE_4G;
            case AccelerometerRange::RANGE_8G: return BMA400_RANGE_8G;
            case AccelerometerRange::RANGE_16G: return BMA400_RANGE_16G;
            default: return 0x0; // 2G by default
        }
    }

    AccelerometerRange fromUInt(uint8_t urange)
    {
        switch (urange)
        {
            case BMA400_RANGE_2G: return AccelerometerRange::RANGE_2G;
            case BMA400_RANGE_4G: return AccelerometerRange::RANGE_4G;
            case BMA400_RANGE_8G: return AccelerometerRange::RANGE_8G;
            case BMA400_RANGE_16G: return AccelerometerRange::RANGE_16G;
            default: return AccelerometerRange::RANGE_2G;
        }
    }

    const char *toString(AccelerometerRange range)
    {
        switch (range)
        {
            case AccelerometerRange::RANGE_2G: return "2g";
            case AccelerometerRange::RANGE_4G: return "4g";
            case AccelerometerRange::RANGE_8G: return "8g";
            case AccelerometerRange::RANGE_16G: return "16g";
            default: return "Unknown range";
        }
    }

    enum class ParameterType : unsigned int
    {
        TO_STR  = 0,
        TO_ENUM = 1,
        TO_UINT = 2,
    };

    static std::variant<unsigned int, const char *, uint8_t> getAccelerometerRange(ParameterType type, unsigned int g_force)
    {
        if (ParameterType::TO_ENUM == type)
            return g_force;
        if (ParameterType::TO_STR == type)
            return toString(static_cast<AccelerometerRange>(g_force));
        if (ParameterType::TO_UINT == type)
            return toUInt(static_cast<AccelerometerRange>(g_force));
        return "Invalid type";
    }
};


static const char *getPowerModeName(int power_mode)
{
    switch (power_mode)
    {
        case 0x00: return "BMA400_MODE_SLEEP";
        case 0x01: return "BMA400_MODE_LOW_POWER";
        case 0x02: return "BMA400_MODE_NORMAL";
        default:   return "UNKNOWN_MODE";
    }
}

// -- BMA 400 LL MANAGER --
class BMA400LLManager
{
    private:
        static inline uint8_t m_uniq_id = 0;  // default = 0
        static inline std::map<uint8_t, BMA400LL&> m_map;

    public:
        static uint8_t register_device(BMA400LL& device);
        static void unregister_device(uint8_t unique_id);
        static BMA400LL& lookup_device(uint8_t unique_id);
};

BMA400LL& BMA400LLManager::lookup_device(uint8_t unique_id)
{
	return m_map.at(unique_id);
}

uint8_t BMA400LLManager::register_device(BMA400LL& device)
{
    DEBUG_TRACE("BMA400LLManager::register_device -> m_unique_id=%d, &device=%p",m_uniq_id, &device);
    m_map.insert({m_uniq_id, device});

	return m_uniq_id++;
}

void BMA400LLManager::unregister_device(uint8_t unique_id)
{
	m_map.erase(unique_id);
}



// -- BMA 400 LL --

BMA400LL::BMA400LL(unsigned int bus, unsigned char addr, int wakeup_pin)
    : m_bus(bus), m_addr(addr), m_irq(NrfIRQ(wakeup_pin)),
		m_unique_id(BMA400LLManager::register_device(*this)), m_accel_sleep_mode(BMA400_MODE_SLEEP),
		m_irq_pending(false)
{
	try {
		init();
	} catch(...) {
		BMA400LLManager::unregister_device(m_unique_id);
		throw;
	}
}

BMA400LL::~BMA400LL() {
	BMA400LLManager::unregister_device(m_unique_id);
}

enum class BMA400POWERMODE : int {
    LOW_POWER   = 0,
    MODE_NORMAL = 1
};

void BMA400LL::init()
{
    uint8_t rslt = 0;

    rslt = init(nullptr);
    bma400_check_rslt(GET_API_NAME(init), rslt);
}

// RANGE 4G, ODR 100, OSR 1 -> but not apply
/**
 * @brief Initializes the BMA400 sensor.
 *
 * This method sets up the BMA400 sensor by configuring its interface, 
 * performing a self-test, and setting it to low-power mode by default.
 * It also performs a soft reset and configures the sensor for low-power mode.
 *
 * @throws ErrorCode::I2C_COMMS_ERROR if there is a communication error with the sensor.
 */
uint8_t BMA400LL::init(std::function<void()> setup_mode = nullptr)
{
    int8_t rslt = 0;

    m_bma400_dev.intf           = BMA400_I2C_INTF;
    m_bma400_dev.intf_ptr       = &m_unique_id; // should be twim pointer but used to search device
    m_bma400_dev.read           = (bma400_read_fptr_t)i2c_read;
    m_bma400_dev.write          = (bma400_write_fptr_t)i2c_write;
    m_bma400_dev.delay_us       = (bma400_delay_us_fptr_t)delay_us;
    m_bma400_dev.read_write_len = BMA400_READ_WRITE_LENGTH;
    // m_bma400_dev.chip_id       read from bma in bma400_init()
    //m_bma400_dev.dummy_byte     = 0;  // only used for SPI
    m_bma400_dev.resolution  = 12; 

    rslt = bma400_init(&m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_init), rslt);

    /* after sensor init introduce 200 msec sleep */
    // PMU::delay_ms(200);

    // rslt = bma400_perform_self_test(&m_bma400_dev);
    // bma400_check_rslt(GET_API_NAME(bma400_perform_self_test), rslt);

    rslt = bma400_soft_reset(&m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_soft_reset), rslt);

    /* Sleep mode is set by default */
    if (setup_mode)
        setup_mode();
    else
        setup_sleep_mode();

