spoemb/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
    /* note: Sleep mode: Registers readable and writable, no sensortime */
    return rslt;
}

int8_t BMA400LL::i2c_write(uint8_t reg_addr, const uint8_t *reg_data, uint32_t length, void *intf_ptr)
{
    //DEBUG_TRACE("BMA400LL::i2c_write -> intf_ptr=%p, *(uint8_t *)intf_ptr=%x", intf_ptr, *(uint8_t *)intf_ptr);

    BMA400LL& device = BMA400LLManager::lookup_device(*(uint8_t *)intf_ptr);

    if (!length)
        return BMA400_OK;
    
    if (length > BMA400_MAX_LEN + sizeof(reg_addr))
        // return BMA400_E_OUT_OF_RANGE; No longer available in the latest version of the BOSCH driver
        return BMA400_E_INVALID_CONFIG;
    
    uint8_t buffer[BMA400_MAX_LEN];
    buffer[0] = reg_addr;
    memcpy(&buffer[1], reg_data, length);

    NrfI2C::write(device.m_bus, device.m_addr, (uint8_t*)buffer, length + sizeof(reg_addr), false);

    //DEBUG_TRACE("BMA400LL::i2c_write %x : %x",reg_addr, reg_data);

    return BMA400_OK;
}

int8_t BMA400LL::i2c_read(uint8_t reg_addr, uint8_t *reg_data, uint32_t length, void *intf_ptr)
{
    //DEBUG_TRACE("BMA400LL::i2c_read -> intf_ptr=%p, *(uint8_t *)intf_ptr=%x", intf_ptr, *(uint8_t *)intf_ptr);

    BMA400LL& device = BMA400LLManager::lookup_device(*(uint8_t *)intf_ptr);

    //DEBUG_TRACE("BMA400LL::i2c_read -> device.m_addr=%p, &reg_addr=%p", device.m_addr, &reg_addr);

    NrfI2C::write(device.m_bus, device.m_addr, &reg_addr, sizeof(reg_addr), true);
    //DEBUG_TRACE("BMA400LL::i2c_read -> (uint8_t*)reg_data=%p, reg_data=%p", (uint8_t*)reg_data, reg_data);

	NrfI2C::read(device.m_bus, device.m_addr, (uint8_t*)reg_data, length);
    //DEBUG_TRACE("BMA400LL::i2c_read %x : %x",reg_addr, reg_data);

    return BMA400_OK;
}

void BMA400LL::delay_us(uint32_t period, void *intf_ptr)
{
    PMU::delay_us(period);
}

double BMA400LL::convert_g_force(unsigned int g_scale, int16_t axis_value)
{
	return (double)g_scale * axis_value / 32768;
}

double BMA400LL::lsb_to_ms2(int16_t accel_data, uint8_t g_range, uint8_t bit_width)
{
    const float gravity_earth = 9.80665f;
    double accel_ms2 = 0;
    int16_t half_scale = 0;

    half_scale = 1 << (bit_width - 1);
    accel_ms2 = (gravity_earth * accel_data * g_range) / half_scale;

    return accel_ms2;
}

void BMA400LL::bma400_check_rslt(const char api_name[], int8_t rslt)
{
    switch (rslt)
    {
        case BMA400_OK:
            /* Do nothing */
            DEBUG_TRACE("BMA400 [%s]",api_name);
            break;
        case BMA400_E_NULL_PTR:
            DEBUG_ERROR("BMA400 Error [%d] : Null pointer\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
        case BMA400_E_COM_FAIL:
            DEBUG_ERROR("BMA400 Error [%d] : Communication failure\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
        case BMA400_E_INVALID_CONFIG:
            DEBUG_ERROR("BMA400 Error [%d] : Invalid configuration\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
        case BMA400_E_DEV_NOT_FOUND:
            DEBUG_ERROR("BMA400 Error [%d] : Device not found\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
        default:
            DEBUG_ERROR("BMA400 Error [%d] : Unknown error code\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
    }
}

void BMA400LL::read_xyz(double& x, double& y, double& z, int16_t& temperature)
{
    DEBUG_TRACE("%s::read_xyz -> m_unique_id=%d", __func__, m_unique_id);
    int8_t rslt = 0;
    //uint8_t power_mode = 0;

    struct bma400_int_enable int_en;
    // Set AXL normal mode
    rslt = bma400_set_power_mode(BMA400_MODE_NORMAL, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

    struct bma400_sensor_conf conf[2];
    conf[0].type = BMA400_ACCEL;
    rslt = bma400_get_sensor_conf(conf, 1, &m_bma400_dev);

    conf[0].param.accel.odr = BMA400_ODR_100HZ;
    conf[0].param.accel.range = m_g_force;
    
    static const uint8_t RANGE_TABLE[4] = { 2, 4, 8, 16 };
    uint8_t g_force = RANGE_TABLE[m_g_force];
    //conf[0].param.accel.range = BMA400_RANGE_4G; // 4G range
    conf[0].param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_2;

    /* Set the desired configurations to the sensor */
    rslt = bma400_set_sensor_conf(&conf[0], 1, &m_bma400_dev);
    bma400_check_rslt("bma400_set_sensor_conf", rslt);

    int_en.type = BMA400_DRDY_INT_EN;
    int_en.conf = BMA400_ENABLE;

    rslt = bma400_enable_interrupt(&int_en, 1, &m_bma400_dev);
    bma400_check_rslt("bma400_enable_interrupt", rslt);

    //float t;
    uint16_t int_status = 0;
    struct bma400_sensor_data data;
    for (int i = 0; i < POLL_MAX_ATTEMPTS; i++)
    {
        rslt = bma400_get_interrupt_status(&int_status, &m_bma400_dev);
        //bma400_check_rslt("bma400_get_interrupt_status", rslt);

        if (int_status & BMA400_ASSERTED_DRDY_INT)
        {
            //rslt = bma400_get_accel_data(BMA400_DATA_SENSOR_TIME, &data, &m_bma400_dev);
            rslt = bma400_get_accel_data(BMA400_DATA_ONLY, &data, &m_bma400_dev);
            //bma400_check_rslt("bma400_get_accel_data", rslt);

            x = lsb_to_ms2(data.x, g_force, 12);
            y = lsb_to_ms2(data.y, g_force, 12);
            z = lsb_to_ms2(data.z, g_force, 12);
            //t = (float)data.sensortime * SENSOR_TICK_TO_S;

            DEBUG_INFO("%s::Acc_Raw_X : %d   Acc_Raw_Y : %d   Acc_Raw_Z : %d", __func__, data.x, data.y, data.z);
            //DEBUG_INFO("%s::Acc_ms2_X : %.2f,   Acc_ms2_Y : %.2f,  Acc_ms2_Z :  %.2f,   t(s) : %.4f", __func__, x, y, z, (double)t);
            DEBUG_INFO("%s::Acc_ms2_X : %.2f,   Acc_ms2_Y : %.2f,  Acc_ms2_Z :  %.2f", __func__, x, y, z);

            constexpr double G_PER_MS2 = 9.80665;  // 1g = 9.80665 m/s²
            x = x / G_PER_MS2;
            y = y / G_PER_MS2;
            z = z / G_PER_MS2;
            DEBUG_INFO("%s::Acc_g_X : %.2f,   Acc_g_Y : %.2f,  Acc_g_Z :  %.2f", __func__, x, y, z);
            // Set AXL normal mode
            rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
            bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);
            return;
        }

        // Optional: sleep between polling to reduce CPU usage
        //nrf_delay_us(POLL_DELAY_MS * 1000);
    }

    DEBUG_WARN("%s:: Timeout: no DRDY interrupt from BMA400", __func__);
    rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);
    return;
}

int16_t BMA400LL::read_temperature()
{
    int8_t rslt = 0;

