spoemb/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
    // Wait 10ms +/-12% for temperature reading
    PMU::delay_us(11200);

    // Read temperature
    int16_t temperature_data;
    bma400_get_temperature_data(&temperature_data, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(BMA400LL::read_temperature), rslt);

    // temperature_data = 195 ---> 19,5 degrees Celsius.

    DEBUG_TRACE("%s = %ld", GET_API_NAME(BMA400LL::read_temperature), temperature_data);
    return temperature_data;
}

void BMA400LL::set_wakeup_threshold(double thresh)
{
	m_wakeup_threshold = thresh;
}

void BMA400LL::set_wakeup_duration(double duration)
{
	m_wakeup_duration = duration;
}

void BMA400LL::set_range(unsigned int g_force)
{
	m_g_force = static_cast<uint8_t>(g_force);
}

void BMA400LL::set_power_mode(unsigned int power_mode)
{
    // assert(power_mode <= UINT8_MAX && "Power mode value out of range for uint8_t"); assert_param ?
    m_power_mode = static_cast<uint8_t>(power_mode);
}

void BMA400LL::set_x_calibration(double x) 
{
    m_x = x;
}

void BMA400LL::set_y_calibration(double y) 
{
    m_y = y;
}

void BMA400LL::set_z_calibration(double z) 
{
    m_z = z;
}

double BMA400LL::get_x_calibration(void)
{
    return m_x;
};

double BMA400LL::get_y_calibration(void)
{
    return m_y;
};

double BMA400LL::get_z_calibration(void)
{
    return m_z;
};

uint8_t BMA400LL::get_power_mode(void)
{
    return m_power_mode;
};

uint8_t BMA400LL::get_gforce(void)
{
    return m_g_force;
};

static uint8_t calculateThreshold(float threshold_g, uint8_t acc_range)
{
    float lsb = static_cast<float>(1 << (2 + acc_range)) / 4096.0f;
    uint16_t threshold_raw = static_cast<uint16_t>(threshold_g / lsb);

    return static_cast<uint8_t>(std::min<uint16_t>(255, threshold_raw));
}

void BMA400LL::disable_wakeup()
{
    int8_t rslt;

	// Disable IRQ
	m_irq.disable();
	rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

	// Disable Generic interrupt 1
	m_bma400_int_en.type = BMA400_GEN1_INT_EN;
	m_bma400_int_en.conf = BMA400_DISABLE;
	rslt = bma400_enable_interrupt(&m_bma400_int_en, 1, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_enable_interrupt), rslt);
    DEBUG_INFO("%s", GET_API_NAME(disable_wakeup));
	m_irq.disable();
}

bool BMA400LL::check_and_clear_wakeup()
{
	InterruptLock lock;
	bool value = m_irq_pending;

	m_irq_pending = false;
	return value;
}

/* Sleep mode */
void BMA400LL::setup_sleep_mode(void)
{
    int8_t rslt = 0;
    uint8_t power_mode = 0;

    rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_TRACE("%s::POWER MODE == <%s>", __func__, getPowerModeName(static_cast<int>(power_mode)));
}

/* Low-power mode */
void BMA400LL::setup_lp_conf(void)
{
    DEBUG_INFO("Entering into %s", GET_API_NAME(BMA400::setup_lp_conf));

    int8_t rslt = 0;
    uint8_t power_mode = 0;

    rslt = bma400_set_power_mode(BMA400_MODE_LOW_POWER, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_TRACE("%s::POWER MODE == <%s>", __FUNCTION__, getPowerModeName(static_cast<int>(power_mode)));

    // m_bma400_sensor_conf[static_cast<int>(BMA400MODE::LOW_POWER)].type                 = BMA400_ACCEL;
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].type                 = BMA400_ACCEL;
    // acc_filt1 has data rate between 12.5Hz and 800Hz
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_1;
    // if the bma400 is in low-power mode, data conversion is fixed at 25Hz.
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.odr      = BMA400_ODR_25HZ;
    // Must be generic TODO : get the value on the config file (pylinkit)
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.range    = std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force));
    // Current consumption between ranges 800 nA and 1200 nA
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.osr_lp   = BMA400_ACCEL_OSR_SETTING_0;

    // accel.fil1_bw = 0.48 * ODR or 0.24 * ODR
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.filt1_bw = static_cast<uint8_t>(0.24 * 12.5);

    /* Set the desired configurations to the sensor */
    rslt = bma400_set_sensor_conf(m_bma400_sensor_conf, 1, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_sensor_conf), rslt);

    return;
}

void BMA400LL::enable_wakeup_lp_mode(std::function<void()> func)
{
    int8_t rslt = 0;
    uint8_t power_mode = 0;

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    struct bma400_device_conf dev_setting[2];

    /* Selecting auto wakeup on wakeup interrupt event */
    dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].type   = BMA400_AUTOWAKEUP_INT;

    /* Get the previously set settings */
	rslt = bma400_get_device_conf(dev_setting, 1, &m_bma400_dev);
    if (rslt == BMA400_OK) {
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.wakeup_axes_en        = BMA400_AXIS_XYZ_EN;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.wakeup_ref_update     = BMA400_UPDATE_EVERY_TIME;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.sample_count          = BMA400_SAMPLE_COUNT_4;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_threshold    = calculateThreshold(m_wakeup_threshold, std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force)));
		// dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_threshold    = 3;
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_x		= 0 */
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_y		= 0 */
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_z		= 32 (0, 0, 1g) */
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_chan              = BMA400_MAP_BOTH_INT_PINS;
    
		rslt = bma400_set_device_conf(dev_setting, 1, &m_bma400_dev);
        if (rslt == BMA400_OK) {
			/* Enable the Generic interrupts in the sensor */
			m_bma400_int_en.type 	= BMA400_GEN1_INT_EN;
			m_bma400_int_en.conf 	= BMA400_ENABLE;
			rslt = bma400_enable_interrupt(&m_bma400_int_en, 1, &m_bma400_dev);
        }
    }

