spoemb/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
	/* Modify the required parameters from the "gen_int" structure present 
	 * inside the "bma400_setting" structure to configure the selected 
	 * GEN1/GEN2 interrupts */
	
	if (rslt == BMA400_OK) {
		/* Set the GEN 1 interrupt for activity detection */
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.int_chan        =   BMA400_INT_CHANNEL_2;
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.axes_sel        =   BMA400_AXIS_XYZ_EN;
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.criterion_sel   =   BMA400_INACTIVITY_INT;
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.evaluate_axes   =   BMA400_ALL_AXES_INT;
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.ref_update      =   BMA400_UPDATE_EVERY_TIME;
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.data_src        =   BMA400_DATA_SRC_ACC_FILT2;
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.gen_int_thres   =   0x05;
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.gen_int_dur     =   100;
		accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.hysteresis      =   BMA400_HYST_0_MG;
		/* accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.int_thres_ref_x  =   0; */
		/* accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.int_thres_ref_y  =   0; */
		/* accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.gen_int.int_thres_ref_z  =   512; */ /* (0, 0, 1g) for gen1 reference, can be ignored here. */

		/* Set the GEN 2 interrupt for in-activity detection */
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.int_chan          =   BMA400_INT_CHANNEL_2;
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.axes_sel          =   BMA400_AXIS_XYZ_EN;
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.criterion_sel     =   BMA400_INACTIVITY_INT;
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.evaluate_axes     =   BMA400_ANY_AXES_INT;
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.ref_update        =   BMA400_UPDATE_ONE_TIME;
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.data_src          =   BMA400_DATA_SRC_ACC_FILT1;
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.gen_int_thres     =   0x10;
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.gen_int_dur       =   0x01;
		accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.gen_int.hysteresis        =   BMA400_HYST_0_MG;
		
		/* Set the configurations in the sensor */
		rslt = bma400_set_sensor_conf(&accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)], 2, &m_bma400_dev);

		if (rslt == BMA400_OK) {
		
			/* Enable the Generic interrupts in the sensor */
			int_en[static_cast<int>(BMA400POWERMODE::LOW_POWER)].type = BMA400_GEN1_INT_EN;
			int_en[static_cast<int>(BMA400POWERMODE::LOW_POWER)].conf = BMA400_ENABLE;
			
			int_en[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].type = BMA400_GEN2_INT_EN;
			int_en[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].conf = BMA400_ENABLE;   /* int this case, gen2 is disabled */

			rslt = bma400_enable_interrupt(&int_en[static_cast<int>(BMA400POWERMODE::LOW_POWER)], 2, &m_bma400_dev);

        }
    }
    m_irq.enable([this, func]() {
        if (!m_irq_pending) {
            m_irq_pending = true;
            func();
        }
    });
}

/* Generic wakeup */

void BMA400LL::enable_wakeup(std::function<void()> func)
{
    uint8_t rslt = 0;
    uint8_t power_mode = m_power_mode;

    rslt = bma400_init(&m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_init),rslt);
    if (rslt != BMA400_OK) {
        DEBUG_ERROR("BMA400 initialization failure");
        throw ErrorCode::I2C_COMMS_ERROR;
    }

    rslt = bma400_soft_reset(&m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_soft_reset), rslt);

    switch (power_mode)
    {
    case 0:
        setup_lp_conf();
	    enable_wakeup_lp_mode(func);
        break;
    case 1:
        setup_normal_conf();
	    enable_wakeup_normal_mode(func);
        break;
    /* auto low-power and normal mode */
    case 2:
        setup_autowakeup_autolowpower_conf();
        enable_wakeup_auto_mode(func);
        break;
    default:
        break;
    }
}


// -- BMA 400 --

BMA400::BMA400() : Sensor("AXL"), m_bma400(BMA400LL(BMA400_DEVICE, BMA400_ADDRESS, BMA400_WAKEUP_PIN)), m_last_x(0), m_last_y(0), m_last_z(0) {
}

void BMA400::calibration_write(const double value, const unsigned int offset)
{
    calibration_write_map = {
        {CalibrationWriteParameter::THRESHOLD, [this, value, offset]() {
            DEBUG_TRACE("%s: THRESHOLD_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
    		m_bma400.set_wakeup_threshold(value);
        }},
        {CalibrationWriteParameter::DURATION, [this, value, offset]() {
    	    DEBUG_TRACE("%s: DURATION_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
    		m_bma400.set_wakeup_duration(value);
        }},
        {CalibrationWriteParameter::GFORCE, [this, value, offset]() {
            DEBUG_TRACE("%s: GFORCE_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
    		m_bma400.set_range(value);
        }},
        {CalibrationWriteParameter::POWER_MODE, [this, value, offset]() {
            DEBUG_TRACE("%s: POWER_MODE_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
            auto current_power_mode = static_cast<CalibrationPowerMode>(value);
            m_bma400.set_power_mode(value);

            if (auto it = calibration_power_mode_map.find(current_power_mode); it != calibration_power_mode_map.end())
                it->second();
            else
                throw ErrorCode::KEY_DOES_NOT_EXIST;
        }},
        {CalibrationWriteParameter::X, [this, value, offset]() {
            DEBUG_TRACE("%s: X_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
            m_bma400.set_x_calibration(value);
        }},
        {CalibrationWriteParameter::Y, [this, value, offset]() {
            DEBUG_TRACE("%s: Y_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
            m_bma400.set_y_calibration(value);
        }},
        {CalibrationWriteParameter::Z, [this, value, offset]() {
            DEBUG_TRACE("%s: Z_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
            m_bma400.set_z_calibration(value);
        }},
    };

    if (calibration_write_map.contains(static_cast<CalibrationWriteParameter>(offset)))
    {
        calibration_write_map.at(static_cast<CalibrationWriteParameter>(offset))();
    } else {
        DEBUG_TRACE("AXL::calibration_write: Invalid offset (%u)", offset);
    }
}

void BMA400LL::calibrate_offset(const uint8_t g_range, double& offset_x, double& offset_y, double& offset_z)
{
    int8_t rslt = 0;
    const uint8_t n_samples = 200;
    double accumulated_x = 0, accumulated_y = 0, accumulated_z = 0;

    for (uint8_t i = 0; i < n_samples; ++i) {
        PMU::delay_ms(10);

        union __attribute__((packed)) {
            uint8_t buffer[6];
            struct {
                int16_t x;
                int16_t y;
                int16_t z;
            };
        } data;

        rslt = bma400_get_regs(BMA400_REG_ACCEL_DATA, data.buffer, sizeof(data.buffer), &m_bma400_dev);
        bma400_check_rslt("BMA400LL::calibrate_offset() bma400_get_regs", rslt);

        accumulated_x += lsb_to_ms2(data.x, g_range, 12);
        accumulated_y += lsb_to_ms2(data.y, g_range, 12);
        accumulated_z += lsb_to_ms2(data.z, g_range, 12);
    }

    offset_x = accumulated_x / n_samples;
    offset_y = accumulated_y / n_samples;
    offset_z = accumulated_z / n_samples;

    DEBUG_TRACE("BMA400LL::calibrate_offset: Offset values: x=%f, y=%f, z=%f", offset_x, offset_y, offset_z);
}

void BMA400::calibration_read(double &value, unsigned int offset)
{
    //GPIOPins::set(SENSORS_PWR_PIN);
    double offset_x = 0.0;
    double offset_y = 0.0;
    double offset_z = 0.0;

