spoemb/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
    calibration_read_map = {
        {CalibrationAxis::X,    [this, &offset_x]() { DEBUG_TRACE("AXL::calibrate: read X"); return offset_x; }},
        {CalibrationAxis::Y,    [this, &offset_y]() { DEBUG_TRACE("AXL::calibrate: read Y"); return offset_y; }},
        {CalibrationAxis::Z,    [this, &offset_z]() { DEBUG_TRACE("AXL::calibrate: read Z"); return offset_z; }},
    };

    if (calibration_power_mode_map.contains(static_cast<CalibrationPowerMode>((m_bma400.get_power_mode()))))
    {
        calibration_power_mode_map.at(static_cast<CalibrationPowerMode>((m_bma400.get_power_mode())))();
        DEBUG_INFO("AXL::calibrate: Valid power mode (%u)", offset);
    } else {
        DEBUG_ERROR("AXL::calibrate: Invalid power mode (%u)", offset);
    }

    m_bma400.calibrate_offset(m_bma400.get_gforce(), offset_x, offset_y, offset_z);

    if (calibration_read_map.contains(static_cast<CalibrationAxis>(offset)))
    {
        value = calibration_read_map.at(static_cast<CalibrationAxis>(offset))();
        DEBUG_INFO("AXL::calibrate: Valid value (%f)", value);
    } else {
        DEBUG_ERROR("AXL::calibrate: Invalid offset (%u)", offset);
        value = 0.0;
    }
    //GPIOPins::clear(SENSORS_PWR_PIN);
}

double BMA400::read(unsigned int offset)
{
	switch(offset)
    {
        case 0: /* temperature */
            return static_cast<double>(m_bma400.read_temperature()/10.0);
        case 1: /* x */
            m_bma400.read_xyz(m_last_x, m_last_y, m_last_z, m_last_temperature);
            return m_last_x; 
        case 2: /* y */
            return m_last_y;
        case 3: /* z */
            return m_last_z;
        case 4: /* Activity compute */
        {
            // constexpr double G_PER_MS2 = 9.80665;  // 1g = 9.80665 m/s²
            // // Convert from m/s² to g
            // double x_g = m_last_x / G_PER_MS2;
            // double y_g = m_last_y / G_PER_MS2;
            // double z_g = m_last_z / G_PER_MS2;

            double g_force_read = std::sqrt(m_last_x * m_last_x + m_last_y * m_last_y + m_last_z * m_last_z);
            uint8_t gforce_max = m_bma400.get_gforce();
            if (g_force_read > gforce_max) g_force_read =  gforce_max;
            if (g_force_read < 0.0) g_force_read = 0.0;

            m_last_activity = static_cast<uint8_t>((g_force_read /  gforce_max) * 255.0);
            DEBUG_TRACE("AXL::compute_activity: x=%f, y=%f, z=%f, g_force_read=%f, activity=%u", m_last_x, m_last_y, m_last_z, g_force_read, m_last_activity);
            return static_cast<double>(m_last_activity);
        }
        case 5: /* IRQ pending */
            return static_cast<double>(m_bma400.check_and_clear_wakeup());
        default:
            return 0.0;
	}
}

void BMA400::install_event_handler(unsigned int, std::function<void()> handler)
{
    m_bma400.enable_wakeup(handler);
};

void BMA400::remove_event_handler(unsigned int)
{
	m_bma400.disable_wakeup();
};
